//* Mook Datas Populated and Exported at Here

import { AiOutlineHome } from "react-icons/ai";
import { MdOutlineArticle, MdMail } from "react-icons/md";
import {
  BsQuestionCircle,
  BsTelephone,
  BsInstagram,
  BsTelegram,
  BsWhatsapp,
  BsFillTelephoneFill,
} from "react-icons/bs";

import {
  Iron_1,
  Iron_2,
  Iron_3,
  Iron_4,
  Iron_5,
  Iron_6,
  Sewing_Machine_1,
  Sewing_Machine_2,
  cloth_1,
  cloth_2,
} from "../assets";

//* Navbar Items
export const NavbarItems = [
  {
    path: "/",
    icon: <AiOutlineHome className="text-lg" />,
    text: "صفحه نخست",
  },
  {
    path: "/blog",
    icon: <MdOutlineArticle className="text-lg" />,
    text: "مقالات آموزشی",
  },
  {
    path: "/about-us",
    icon: <BsQuestionCircle className="text-lg" />,
    text: "درباره ما",
  },
  {
    path: "contact-us",
    icon: <BsTelephone className="text-lg rotate-[270deg]" />,
    text: "تماس با ما",
  },
];

//* Services Items
export const ServicesItems = [
  {
    title: "اتو و بسته بندی",
    subTitle: "با کیفیت بالا و مقرون به صرفه",
    iconPath: Iron_1,
    bodyText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
  {
    title: "اتو و بسته بندی",
    subTitle: "با کیفیت بالا و مقرون به صرفه",
    iconPath: Iron_2,
    bodyText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
  {
    title: "اتو و بسته بندی",
    subTitle: "با کیفیت بالا و مقرون به صرفه",
    iconPath: Iron_3,
    bodyText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
  {
    title: "اتو و بسته بندی",
    subTitle: "با کیفیت بالا و مقرون به صرفه",
    iconPath: Iron_4,
    bodyText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
  {
    title: "اتو و بسته بندی",
    subTitle: "با کیفیت بالا و مقرون به صرفه",
    iconPath: Iron_5,
    bodyText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
  {
    title: "اتو و بسته بندی",
    subTitle: "با کیفیت بالا و مقرون به صرفه",
    iconPath: Iron_6,
    bodyText:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
  },
];

//* Home Contact Section Social Items
export const SocialItems = [
  {
    link: "",
    titleText: "",
    icon: <BsInstagram />,
  },
  {
    link: "",
    titleText: "",
    icon: <BsTelegram />,
  },
  {
    link: "",
    titleText: "",
    icon: <BsWhatsapp />,
  },
  {
    link: "",
    titleText: "",
    icon: <MdMail />,
  },
  {
    link: "tel:09375656283",
    titleText: "",
    icon: <BsFillTelephoneFill />,
  },
];

export const Blog_Posts = [
  {
    title: "لورم ایپسوم یه تیتر تستی مقاله",
    bodyText: "",
    image: Sewing_Machine_1,
  },
  {
    title: "لورم ایپسوم یه تیتر تستی مقاله",
    bodyText: "لورم ایپسوم یه تیتر تستی مقاله",
    image: Sewing_Machine_2,
  },
  {
    title: "لورم ایپسوم یه تیتر تستی مقاله",
    bodyText: "",
    image: cloth_1,
  },
  {
    title: "لورم ایپسوم یه تیتر تستی مقاله",
    bodyText: "",
    image: cloth_2,
  },
];

export const FooterAccessColumns = [
  {
    title: "دسترسی سریع",
    links: ["محصولات", "مقالات آموزشی", "درباره ما", "تماس با ما"],
  },
  {
    title: "خدمات ما",
    links: ["اتو و بسته بندی", "خشکشویی", "دوخت و برش", "چاپ و تبلیغات"],
  },
];
